{"data":{"site":{"siteMetadata":{"disqus":"gatsby-typescript"}},"post":{"html":"<p>One of the most common claims that businesses and homeowners experience is slip &#x26; fall accidents.  By taking a proactive approach these incidents can be greatly reduced or even eliminated.  For our discussion here we will be looking at this exposure from a businesses point of view, but the concepts can also be used in your home.</p>\n<p>Pay attention to your surroundings at work, look for potential slip and fall exposures.  Is the lighting for your stairs adequate, are there unanchored rugs or loose mats, is there good traction on your floor and walking surfaces, uncovered cables, uneven sidewalks &#x26; steps, clutter or obstructed views?  In most cases these issues can be addressed and corrected easily.</p>\n<p>Established policies and practices can be implemented to significantly reduce the number of slips, trips and falls.  Make it your company’s policy to bring slip and fall exposures to the attention of management.  Any spills should be cleaned up immediately, always close file and cabinet drawers, keep flooring in good condition, change burned out light bulbs, in winter make sure parking lots are cleared and salted on a regular basis.  </p>\n<p>Safety signs to remind people of slip, trip and fall hazards are also helpful, particularly where the peril cannot be removed or corrected.  Yellow stripping to identify walking and working areas are most effective if their meaning is enforced. For example, striped areas should mean that no object should be placed in these areas.</p>\n<p>Take a few minutes and walk around your business, you may be surprised at what you find.</p>\n<p>Please feel free to call us if you have questions or feel we can be of service, call Hurst-Weiss Insurance 412-922-8222 or visit our website www.hurstweiss.com</p>","excerpt":"One of the most common claims that businesses and homeowners experience is slip & fall accidents.  By taking a proactive approach these…","timeToRead":1,"fields":{"slug":"/blog/2019-06-29--preventing-slip-fall-accidents/"},"frontmatter":{"tags":["business"],"title":"Preventing Slip & Fall Accidents","updatedDate":"Jun 29, 2019"}},"recents":{"edges":[{"node":{"fields":{"slug":"/blog/2019-06-29--do-you-need-professional-and-general-liability-coverage/"},"timeToRead":1,"frontmatter":{"title":"Do you need Professional and General Liability Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--does-your-business-need-terrorism-coverage/"},"timeToRead":1,"frontmatter":{"title":"Does Your Business Need Terrorism Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--why-is-the-correct-named-insured-on-a-policy-important/"},"timeToRead":1,"frontmatter":{"title":"Why Is The Correct Named Insured On A Policy Important?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--protecting-your-business-from-employee-theft/"},"timeToRead":1,"frontmatter":{"title":"Protecting Your Business From Employee Theft","author":{"id":"Mike Konopelski"}}}}]}},"pageContext":{"slug":"/blog/2019-06-29--preventing-slip-fall-accidents/"}}