{"data":{"site":{"siteMetadata":{"disqus":"gatsby-typescript"}},"post":{"html":"<p>After 9/11 insurance carriers and the United States government needed to address insurance coverage related to terroristic acts and remedied the problem with the Terrorism Risk Insurance Act (TRIA).  TRIA ensures that adequate resources are available for businesses to recover and rebuild if they are victims of a terrorist attack.  Since 2002 all property and casualty insurers in the U. S. must offer terrorism coverage.</p>\n<p>In the past when a client wanted to decline terrorism coverage, I would not put up much resistance as we are in Pittsburgh (and the surrounding suburbs), as the chance of terrorism seemed unlikely.  But as San Bernardino showed us a few years ago, terrorism can happen anywhere, so my advice to my clients has changed. If you do not have terrorism coverage included on your business insurance policy, you should consider adding it at your next renewal.</p>\n<p>Please note that this is not an attempt to scare people into buying additional insurance coverage.  Unfortunately our world is changing and when reviewing our insurance needs, the terrorism issue needs to be considered.  Coverage under TRIA is inexpensive and easily accessible.  Please note your Homeowners insurance policy includes coverage for terrorism.</p>\n<p>Please feel free to call us if you have questions or feel we can be of service, call Hurst-Weiss Insurance 412-922-8222 or visit our website www.hurstweiss.com</p>","excerpt":"After 9/11 insurance carriers and the United States government needed to address insurance coverage related to terroristic acts and remedied…","timeToRead":1,"fields":{"slug":"/blog/2019-06-29--does-your-business-need-terrorism-coverage/"},"frontmatter":{"tags":["business"],"title":"Does Your Business Need Terrorism Coverage?","updatedDate":"Jun 29, 2019"}},"recents":{"edges":[{"node":{"fields":{"slug":"/blog/2019-06-29--do-you-need-professional-and-general-liability-coverage/"},"timeToRead":1,"frontmatter":{"title":"Do you need Professional and General Liability Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--preventing-slip-fall-accidents/"},"timeToRead":1,"frontmatter":{"title":"Preventing Slip &amp; Fall Accidents","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--why-is-the-correct-named-insured-on-a-policy-important/"},"timeToRead":1,"frontmatter":{"title":"Why Is The Correct Named Insured On A Policy Important?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--protecting-your-business-from-employee-theft/"},"timeToRead":1,"frontmatter":{"title":"Protecting Your Business From Employee Theft","author":{"id":"Mike Konopelski"}}}}]}},"pageContext":{"slug":"/blog/2019-06-29--does-your-business-need-terrorism-coverage/"}}