{"data":{"site":{"siteMetadata":{"disqus":"gatsby-typescript"}},"post":{"html":"<p>Most property owners are given one of two options when insuring the value of the property they own, Replacement Cost or Actual Cash Value.  In most cases you want to insure your property for Replacement Cost which is usually defined in the policy as the cost to replace the damaged property with materials of like kind and quality, without any deduction for depreciation.  For example, if your 12 year old refrigerator is lost in a fire, a policy written at replacement cost will pay for a brand new refrigerator. This would also apply to rebuilding a structure.</p>\n<p>An Actual Cash Value Policy is typically calculated one of three ways: (1) the cost to repair or replace the damaged property, minus depreciation; (2) the damaged property's \"fair market value\"; or (3) using the \"broad evidence rule,\" which calls for considering all relevant evidence of the value of the damaged property.  So the 12 year old refrigerated used in the example above would be depreciated from it replacement cost due to its age.  Older properties that would not be rebuilt are often insured at Actual Cash Value.</p>\n<p>Insuring a building at Functional Replacement Cost is defined as the cost of acquiring another item of property that will perform the same function with equal efficiency, even if it is not identical to the property being replaced.  Functional Replacement Coverage can be used when a functionally equivalent building can replace the original building at a lower cost than by an identical replacement. Using this cost valuation provides a lower valuation than replacement cost, resulting in a reduction of the amount of insurance coverage required which lowers premiums.  Functional replacement cost also eliminates coinsurance clause and Ordinance or Law issue, this is important for owners of older buildings.  Functional Replacement Coverage is an option that most agents overlook.</p>\n<p>When you are insuring a property make sure that you utilize these coverages to your benefit.  </p>","excerpt":"Most property owners are given one of two options when insuring the value of the property they own, Replacement Cost or Actual Cash Value…","timeToRead":1,"fields":{"slug":"/blog/2019-06-29--the-difference-between-replacement-cost-actual-cash-value-and-functional-replacement-cost/"},"frontmatter":{"tags":["business","personal"],"title":"The Difference between Replacement Cost, Actual Cash Value and Functional Replacement Cost","updatedDate":"Jun 29, 2019"}},"recents":{"edges":[{"node":{"fields":{"slug":"/blog/2019-06-29--do-you-need-professional-and-general-liability-coverage/"},"timeToRead":1,"frontmatter":{"title":"Do you need Professional and General Liability Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--does-your-business-need-terrorism-coverage/"},"timeToRead":1,"frontmatter":{"title":"Does Your Business Need Terrorism Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--false-pretense-exclusion-social-engineering/"},"timeToRead":1,"frontmatter":{"title":"False Pretense Exclusion & Social Engineering","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--preventing-slip-fall-accidents/"},"timeToRead":1,"frontmatter":{"title":"Preventing Slip & Fall Accidents","author":{"id":"Mike Konopelski"}}}}]}},"pageContext":{"slug":"/blog/2019-06-29--the-difference-between-replacement-cost-actual-cash-value-and-functional-replacement-cost/"}}