{"data":{"site":{"siteMetadata":{"disqus":"gatsby-typescript"}},"post":{"html":"<p>A 2014 Association of Certified Fraud Examiners (ACFE) study reported that the median loss for the retail businesses was $ 54,000 for employee fraud and dishonesty (theft).  Unfortunately, small organizations are victimized more that larger businesses due to inadequate control systems that are put in place.  Normally fraudulent activities occur at least 18 months before they are detected.  </p>\n<p>Fortunately there are early warning signs displayed by fraud perpetuators.  The warning signs include financial difficulties, living beyond one’s means, unwillingness to share duties, unusually close relationship with a vendor or customer, refusal to take vacations, past employment issues and irritability, suspiciousness or defensiveness.  </p>\n<p>Some steps that should be included in your plan to address employee theft or fraud include:</p>\n<ul>\n<li>Prior employment checks including checking references, educational transcripts and random drug testing policy.</li>\n<li>Put controls on handling deposits, using computerized inventory system, have inventories conducted by someone who does not have custody or control of inventory records, Utilize centralized purchasing and segregation of purchasing, receiving, store keeping and shipping duties.   One person can not be in control of these duties from beginning to end.</li>\n<li>Verify receipt of merchandise before payment for goods is made.</li>\n<li>Cash or credits of returned merchandise must be authorized by two people.</li>\n<li>Spot checks on all controls to ensure that all the steps have followed the proper controls and documentation.</li>\n</ul>\n<p>Please feel free to call us if you have questions or feel we can be of service, call Hurst-Weiss Insurance 412-922-8222 or visit our website www.hurstweiss.com</p>","excerpt":"A 2014 Association of Certified Fraud Examiners (ACFE) study reported that the median loss for the retail businesses was $ 54,000 for…","timeToRead":1,"fields":{"slug":"/blog/2019-06-29--protecting-your-business-from-employee-theft/"},"frontmatter":{"tags":["business"],"title":"Protecting Your Business From Employee Theft","updatedDate":"Jun 29, 2019"}},"recents":{"edges":[{"node":{"fields":{"slug":"/blog/2019-06-29--do-you-need-professional-and-general-liability-coverage/"},"timeToRead":1,"frontmatter":{"title":"Do you need Professional and General Liability Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--does-your-business-need-terrorism-coverage/"},"timeToRead":1,"frontmatter":{"title":"Does Your Business Need Terrorism Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--why-is-the-correct-named-insured-on-a-policy-important/"},"timeToRead":1,"frontmatter":{"title":"Why Is The Correct Named Insured On A Policy Important?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--preventing-slip-fall-accidents/"},"timeToRead":1,"frontmatter":{"title":"Preventing Slip & Fall Accidents","author":{"id":"Mike Konopelski"}}}}]}},"pageContext":{"slug":"/blog/2019-06-29--protecting-your-business-from-employee-theft/"}}