{"data":{"site":{"siteMetadata":{"disqus":"gatsby-typescript"}},"post":{"html":"<p>This is a question that comes up from time to time when we are working with our business insurance clients.  Let’s start off with looking at what general liability and professional Liability insurance covers.  </p>\n<p>General Liability provides coverage for bodily injury or property damage to a person or their property.  This is a must-have coverage for all businesses.  A good example of a bodily injury claim is when a customer visits your business and slips and falls on an icy side walk.   A contractor, who when installing a new kitchen, does not turn off the water supply and floods the kitchen and basement of his client would be an example of a property damage claim. </p>\n<p>Professional Liability covers lawsuits that stem from your professional services which result in a financial loss (excluding property damage or bodily injury).  This includes negligent professional services, incomplete or substandard work, failure to live up to a contract, a mistake or omission.  It can also be known as Errors &#x26; Omissions or Malpractice Insurance.  An example of this would be a Real Estate Agent failing to disclose a material fact about a property he sold causing the buyer additional expenses to remediate.  This would result in a lawsuit against the agent.</p>\n<p>The answer to the question of do you need both coverages depends on your business.  Businesses like accountants, engineers, lawyers, real estate &#x26; insurance agents have a huge exposure for professional liability claims because they are giving advice to customers that can cause damages without causing bodily injury or property damage.  </p>\n<p>A professional liability claim can be one of the most expensive claims a business could face.  A professional liability policy will provide defense coverage for you even if the suit has no merit.  Unfortunately in today’s legal environment you do not have to be negligent for a suit to be brought against you.</p>\n<p>Please feel free to call if you have questions or feel we can be of service, call Hurst-Weiss Insurance 412-922-8222 or visit our website www.hurstweiss.com</p>","excerpt":"This is a question that comes up from time to time when we are working with our business insurance clients.  Let’s start off with looking at…","timeToRead":1,"fields":{"slug":"/blog/2019-06-29--do-you-need-professional-and-general-liability-coverage/"},"frontmatter":{"tags":["liability","business"],"title":"Do you need Professional and General Liability Coverage?","updatedDate":"Jun 29, 2019"}},"recents":{"edges":[{"node":{"fields":{"slug":"/blog/2019-06-29--does-your-business-need-terrorism-coverage/"},"timeToRead":1,"frontmatter":{"title":"Does Your Business Need Terrorism Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--why-is-the-correct-named-insured-on-a-policy-important/"},"timeToRead":1,"frontmatter":{"title":"Why Is The Correct Named Insured On A Policy Important?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--preventing-slip-fall-accidents/"},"timeToRead":1,"frontmatter":{"title":"Preventing Slip & Fall Accidents","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--protecting-your-business-from-employee-theft/"},"timeToRead":1,"frontmatter":{"title":"Protecting Your Business From Employee Theft","author":{"id":"Mike Konopelski"}}}}]}},"pageContext":{"slug":"/blog/2019-06-29--do-you-need-professional-and-general-liability-coverage/"}}