{"data":{"site":{"siteMetadata":{"disqus":"gatsby-typescript"}},"post":{"html":"<p>All workers compensation and most general liability insurance policies are auditable. Because payrolls and sales figures can change from year to year, insurance policies are written using an estimate for the upcoming policy period. Shortly after your policy expires you will receive a request to complete an audit form that you or your accountant can complete and return or an auditor may set up a time to visit your business and conduct an audit at your facility. It is important to have your payroll/sales records and the last four quarters of your State Unemployment tax filings (941's) available. After this process is completed, you will receive the completed audit from the insurance company showing that you owe the insurance company money, the insurance company owes you or there is no balance due to you or the insurance company, an even audit.</p>\n<p>When you receive an audit it is mandated in your policy that you must comply. Failure to do so can result in an assumed audit which is generally an increase of 25 to 50 percent of your assumed sales and/or payroll. Carriers do this to get insured's to comply with their audit request. Insurance companies also have the right to cancel your policy at the next renewal for failure to complete the requested audit. If you do receive an assumed audit you have the right to appeal and submit the documentation for your audit and your premium will be adjusted after the audit is completed. To avoid the hassle of appealing an assumed audit, it is recommended to complete audits in a timely manner.</p>\n<p>When you have an audit that results in a higher premium, you will be billed for the balance of the prior year as the audit is a look back. Insurance companies can also endorse your renewed policy with these higher amounts in order to avoid a large audit the following year. When this occurs your company will be billed for both policies concurrently thus putting a strain on your cash flow (some carriers will expect payment in full when the audit is completed). When we are working with a client who is new and is unsure of what their sales and payroll will be, we check with them regularly during the policy term and update sales and payroll figure during the policy period. By doing this we can spread out the increased costs over the policy period, thus preserving cash flow. This method can also be used with existing businesses that are experiencing changes in sales and payrolls.</p>\n<p>If you feel that your audit is incorrect you have the right to file an appeal.  Your agent can help you obtain the worksheets from your audit and help file your appeal.  When going through the audit process your agent can be a valuable asset to your company. An experience commercial insurance agent can help guide you through the process, catch mistakes and act as a conduit to the auditor and insurance company.</p>","excerpt":"All workers compensation and most general liability insurance policies are auditable. Because payrolls and sales figures can change from…","timeToRead":2,"fields":{"slug":"/blog/2019-01-26--insurance-audits/"},"frontmatter":{"tags":["workers-compensation","audit","business"],"title":"Insurance Audits","updatedDate":"Jan 26, 2019"}},"recents":{"edges":[{"node":{"fields":{"slug":"/blog/2019-06-29--do-you-need-professional-and-general-liability-coverage/"},"timeToRead":1,"frontmatter":{"title":"Do you need Professional and General Liability Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--does-your-business-need-terrorism-coverage/"},"timeToRead":1,"frontmatter":{"title":"Does Your Business Need Terrorism Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--preventing-slip-fall-accidents/"},"timeToRead":1,"frontmatter":{"title":"Preventing Slip & Fall Accidents","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--false-pretense-exclusion-social-engineering/"},"timeToRead":1,"frontmatter":{"title":"False Pretense Exclusion & Social Engineering","author":{"id":"Mike Konopelski"}}}}]}},"pageContext":{"slug":"/blog/2019-01-26--insurance-audits/"}}