{"data":{"site":{"siteMetadata":{"disqus":"gatsby-typescript"}},"post":{"html":"<p>The False Pretense exclusion is applied in an insurance policy when there is a voluntary parting with any property by you or anyone else to whom you have entrusted property if induced to do so by any fraudulent scheme, trick or false pretense.  In other words a criminal will trick you or an employee into voluntarily giving them your property.  When you willingly hand over your property, your insurance policy will not make you whole to this loss.</p>\n<p>A couple examples of this would be an employee of a company receiving a request by email from a client, vendor or supervisor advising them to transfer funds to an account.  The email has the correct logo and looks right, unfortunately the account that the funds are being sent to are that of the criminal.  Or, in another situation a new customer (normally on line or by phone) tricking a business to accepting a stolen credit card, that the business owner or employee are unaware has been canceled by the credit card company. They have been misled into believing that the card has been accepted by the “bank” and find out after the item was shipped to the crook that the credit card was declined.  They are out the cost of their product.</p>\n<p>Unfortunately criminals are becoming more sophisticated when engaging in fraud.  Fraud can be a little harder to detect than in the past when you would get an email from the Crown Prince asking for your help with a financial matter.   It is important that you and your employees pay attention to red flags when dealing with people.</p>\n<p>In the cyber world this type of fraud is called Social Engineering and it is costing companies a lot of money.  Please note that most cyber liability policies will have an exclusion for this type of claim, as the cost to insurance carriers if they paid these types of claims would be excessive.  So make sure that you implement safeguards, and immediately report any fraud to the police.</p>\n<p>As always, if you have any questions or feel we call be of service to you please call or email.</p>","excerpt":"The False Pretense exclusion is applied in an insurance policy when there is a voluntary parting with any property by you or anyone else to…","timeToRead":1,"fields":{"slug":"/blog/2019-06-29--false-pretense-exclusion-social-engineering/"},"frontmatter":{"tags":["business"],"title":"False Pretense Exclusion & Social Engineering","updatedDate":"Jun 29, 2019"}},"recents":{"edges":[{"node":{"fields":{"slug":"/blog/2019-06-29--do-you-need-professional-and-general-liability-coverage/"},"timeToRead":1,"frontmatter":{"title":"Do you need Professional and General Liability Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--does-your-business-need-terrorism-coverage/"},"timeToRead":1,"frontmatter":{"title":"Does Your Business Need Terrorism Coverage?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--why-is-the-correct-named-insured-on-a-policy-important/"},"timeToRead":1,"frontmatter":{"title":"Why Is The Correct Named Insured On A Policy Important?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-06-29--preventing-slip-fall-accidents/"},"timeToRead":1,"frontmatter":{"title":"Preventing Slip & Fall Accidents","author":{"id":"Mike Konopelski"}}}}]}},"pageContext":{"slug":"/blog/2019-06-29--false-pretense-exclusion-social-engineering/"}}