{"data":{"site":{"siteMetadata":{"disqus":"gatsby-typescript"}},"post":{"html":"<p>For years insurance companies have been using credit-based insurance scores to determine the premiums that consumers pay for insurance policies. When you apply for insurance, the insurance company will get your credit information from one of the three major US credit bureaus. Your information is entered into a computer program designed by the insurance company to determine your insurance score. Most carriers look at your payment history, credit utilization, collections and bankruptcies. If you pay your bills on time you will have a better score than someone who is always late. People who carry high credit card balances will also have a lower insurance credit score. </p>\n<p>People with better insurance scores generally file fewer claims and have lower amounts paid out on insurance claims. Research shows that clients with certain patterns of behavior in using credit are more likely to have losses. The Federal Trade Commission has found that by using insurance credit scoring, insurance companies are able to make the underwriting of an insurance risk faster and less expensive, with the savings being passed on to consumers with better insurance scores.</p>\n<p>When a creditor looks at your credit report the credit bureau lists it as an inquiry on your credit. The number of inquiries also has an impact on your report. Please note only inquiries for credit that you initiate affect your insurance score. A way to improve your credit score is to limit inquiries you initiated on your credit report, pay your bills on time and not carry high credit card balances.</p>\n<p>Please note that insurance companies do not notify agents your credit score. You should review your credit report annually for mistakes which can adversely affect your credit score and the cost of your insurance. All consumers are entitled to one free credit report a year. You can go on line at www.annualcreditreport.com or call 1-877-322-8228 for your credit score.</p>","excerpt":"For years insurance companies have been using credit-based insurance scores to determine the premiums that consumers pay for insurance…","timeToRead":1,"fields":{"slug":"/blog/2019-01-27--how-insurance-companies-use-credits-scores/"},"frontmatter":{"tags":["credit"],"title":"How Insurance Companies Use Credit Scores","updatedDate":"Jan 27, 2019"}},"recents":{"edges":[{"node":{"fields":{"slug":"/blog/2019-01-26--does-your-business-have-a-cyber-liability-exposure/"},"timeToRead":2,"frontmatter":{"title":"Does Your Business Have a Cyber Liability Exposure?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-01-26--why-should-i-buy-a-renter-s-insurance-policy/"},"timeToRead":1,"frontmatter":{"title":"Why Should I Buy A Renter’s Insurance Policy?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-01-26--insurance-audits/"},"timeToRead":2,"frontmatter":{"title":"Insurance Audits","author":{"id":"Mike Konopelski"}}}}]}},"pageContext":{"slug":"/blog/2019-01-27--how-insurance-companies-use-credits-scores/"}}