{"data":{"site":{"siteMetadata":{"disqus":"gatsby-typescript"}},"post":{"html":"<p>A renter’s insurance policy provides a great deal of value &#x26; protection for the price to individuals and families.</p>\n<p>Following are some key reasons to consider purchasing this important coverage:</p>\n<ul>\n<li>Coverage is a lot less expensive than most people think. A policy with a contents limit of $ 25,000 for your personal belongings and a liability limit of $ 100,000 can cost under $ 15 a month.</li>\n<li>You have a lot more stuff that you think.  Most people underestimate how much it would cost to replace their things at today’s prices if they lost everything in a fire.  If you do a quick personal inventory, you will see how fast it adds up.</li>\n<li>Renters insurance policies can be written at replacement cost thus eliminated the need to replace your stuff with used items.</li>\n<li>Landlords do not provide coverage for your personal belonging in the event of a loss.  Unfortunately, many renters find this out after a claim. </li>\n<li>Many landlords require you to carry renter’s insurance coverage.</li>\n<li>Your belongings are covered for theft and other types of losses while you are away traveling or while stored in your car.</li>\n<li>A renter’s policy also provides liability protection.  This protects you against lawsuits that involve property damage and bodily injury.  The act that causes the claim is not limited to your apartment, the coverage follows you.</li>\n<li>A renter’s policy pays the additional costs involved when forced to move after a loss (like a fire).  These costs can include the cost of hotel &#x26; restaurant meals along with other costs that are above your normal daily expenses.</li>\n</ul>","excerpt":"A renter’s insurance policy provides a great deal of value & protection for the price to individuals and families. Following are some key…","timeToRead":1,"fields":{"slug":"/blog/2019-01-26--why-should-i-buy-a-renter-s-insurance-policy/"},"frontmatter":{"tags":["renters-insurance"],"title":"Why Should I Buy A Renter’s Insurance Policy?","updatedDate":"Jan 26, 2019"}},"recents":{"edges":[{"node":{"fields":{"slug":"/blog/2019-01-27--how-insurance-companies-use-credits-scores/"},"timeToRead":1,"frontmatter":{"title":"How Insurance Companies Use Credits Scores","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-01-26--does-your-business-have-a-cyber-liability-exposure/"},"timeToRead":2,"frontmatter":{"title":"Does Your Business Have a Cyber Liability Exposure?","author":{"id":"Mike Konopelski"}}}},{"node":{"fields":{"slug":"/blog/2019-01-26--insurance-audits/"},"timeToRead":2,"frontmatter":{"title":"Insurance Audits","author":{"id":"Mike Konopelski"}}}}]}},"pageContext":{"slug":"/blog/2019-01-26--why-should-i-buy-a-renter-s-insurance-policy/"}}